{"pageProps":{"project":{"title":"FTC 2019 Maryland Tech Invitational Robot","description":"Rebuild of the FIRST Tech Challenge 2019-2020 \"Rover Ruckus\" season robot for the 2020 Maryland Tech Invitational competition.","slug":"mti2019-robot","content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, {})\n  })) : _createMdxContent();\n  function _createMdxContent() {\n    const _components = Object.assign({\n      p: \"p\"\n    }, _provideComponents(), props.components);\n    return _jsxs(_Fragment, {\n      children: [_jsx(_components.p, {\n        children: \"I rebuilt the intake system once again to further reduce the torque required to lift the collector, as intake actuation was still slow on the previous revision.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"This robot was built for an off-season invitational, so the team decided to explore novel mechanisms rarely used in FIRST Tech Challenge. We created a power take-off mechanism to switch motor power between the scoring lift, used to deliver game elements to the scoring location, and the hanging lift used to lift the robot at the end of the match. I enjoyed exploring a technology rarely used in the competition. We were building in unproven territory, and watching the gearbox successfully shift gears for the first time was thrilling.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Our robot for this competition was very heavy at 45lb; therefore, we needed to allocate 2 motors to a mechanism that would lift the robot at the end of the match to score points, leaving no motors for the delivery mechanism. To solve this problem, I built a shifting gearbox to switch motor power between these two mechanisms.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"Many parts in the gearbox are adapted FIRST Robotics Competition parts. The only compact ball shifter available was designed for a pneumatic piston. Pneumatics are not legal in FTC, so I designed a servo-actuated cam system instead to select gears. Knowing nothing about cams, I developed the cam geometry by 3D printing and testing multiple iterations.\"\n      }), \"\\n\", _jsx(_components.p, {\n        children: \"To my surprise, this gearbox worked extremely well and could shift gears in under half a second. This was my first time exploring uncharted territory in FTC robotics, and it was empowering to see it work as well as it did.\"\n      })]\n    });\n  }\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}},"thumbnail":"/projects/mti2019-robot/media/CompleteRobotSimplified.png","images":["/projects/mti2019-robot/media/CompleteRobotSimplified.png","/projects/mti2019-robot/media/HangLift.png","/projects/mti2019-robot/media/Intake.png","/projects/mti2019-robot/media/ScoreLiftMirSlides.png","/projects/mti2019-robot/media/Shifter.png"]}},"__N_SSG":true}